# LabelOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Viewport..::..LabelOffset Property
Viewport Class See Also
---
The offset is a two-dimensional vector from left bottom corner of the viewport with Rotation set to None to the left end of the viewport label line. The Z coordinate is ignored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public XYZ LabelOffset { get; set; }
```

Visual Basic
---
```text
Public Property LabelOffset As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ LabelOffset {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Viewport Class
Autodesk.Revit.DB Namespace